load_test_results/20260228_210923_Login_Page.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking thethinkingmind.net (be patient)
Finished 1221 requests


Server Software:        Apache
Server Hostname:        thethinkingmind.net
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        thethinkingmind.net

Document Path:          /login.php
Document Length:        2423 bytes

Concurrency Level:      10
Time taken for tests:   60.011 seconds
Complete requests:      1221
Failed requests:        0
Total transferred:      3432231 bytes
HTML transferred:       2958483 bytes
Requests per second:    20.35 [#/sec] (mean)
Time per request:       491.492 [ms] (mean)
Time per request:       49.149 [ms] (mean, across all concurrent requests)
Transfer rate:          55.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       66   81   8.5     80     246
Processing:    56  406 382.7     82    1866
Waiting:       56  406 382.8     81    1866
Total:        130  487 382.3    170    1940

Percentage of the requests served within a certain time (ms)
  50%    169
  66%    803
  75%    839
  80%    863
  90%    899
  95%    905
  98%    987
  99%   1796
 100%   1940 (longest request)